rocksdb/experiments/M2/results/20260429-052804-budget-sensitivity/bmin_6_ptarget_0/budget_on/run_1/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 05:32:27 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777440747333533 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       7.569 micros/op 132123 ops/sec 37.843 seconds 5000000 operations;  131.0 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :       9.363 micros/op 106800 ops/sec 46.816 seconds 5000000 operations;  105.9 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :       8.665 micros/op 115410 ops/sec 43.324 seconds 5000000 operations;  114.5 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0     14/0   871.94 MB   3.5      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    589.2     25.37             19.49       240    0.106       0      0       0.0       0.0
  L1     18/1    1.09 GB   4.1     26.4    13.7     12.6      23.3     10.6       0.0   1.7    364.5    321.6     74.09             58.95        19    3.900     26M  3158K       0.0       0.0
  L2     89/3    4.52 GB   1.7     20.9     9.0     11.9      15.8      4.0       0.6   1.8    425.6    323.0     50.23             39.09       135    0.372     21M  5122K       0.0       0.0
 Sum    121/4    6.46 GB   0.0     47.2    22.7     24.5      53.7     29.2       0.6   3.7    323.2    367.4    149.69            117.53       394    0.380     48M  8280K       0.0       0.0
 Int      0/0    0.00 KB   0.0     47.0    22.5     24.5      53.1     28.6       0.6   3.7    324.3    366.4    148.41            116.56       387    0.383     47M  8276K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     47.2    22.7     24.5      39.1     14.6       0.0   0.0    389.2    322.1    124.33             98.04       154    0.807     48M  8280K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    589.2     25.37             19.49       240    0.106       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 128.0 total, 125.0 interval
Flush(GB): cumulative 14.597, interval 14.232
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 53.71 GB write, 429.69 MB/s write, 47.25 GB read, 378.01 MB/s read, 149.7 seconds
Interval compaction: 53.10 GB write, 435.08 MB/s write, 47.01 GB read, 385.11 MB/s read, 148.4 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 15, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 15, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 15, total-stops: 0
interval: 15 total count
Block cache LRUCache@0x558b760e9df0#83799 capacity: 32.00 MB seed: 744138653 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000179 secs_since: 128
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 128.0 total, 125.0 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 118.02 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 118.02 MB/s
Cumulative stall: 00:00:37.925 H:M:S, 29.6 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14677.99 MB, 117.44 MB/s
Interval WAL: 14M writes, 0 syncs, 14574800.00 writes per sync, written: 14.33 GB, 117.44 MB/s
Interval stall: 00:00:37.925 H:M:S, 30.3 percent
Write Stall (count): write-buffer-manager-limit-stops: 0